In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os

# NSW Department of Education
https://data.nsw.gov.au/data/dataset/nsw-education-suspensions-and-expulsions-in-nsw-government-schools#:~:text=This%20dataset%20provides%20information%20on,expulsions%20in%20NSW%20government%20schools

In [9]:
# cargar data 
df_t1 = pd.read_csv('tables_pages_3-14_16/table_01_page3.csv')
df_t2 = pd.read_csv('tables_pages_3-14_16/table_02_page4.csv')
df_t3 = pd.read_csv('tables_pages_3-14_16/table_03_page5.csv', on_bad_lines='skip')
df_t4 = pd.read_csv('tables_pages_3-14_16/table_04_page6.csv', on_bad_lines='skip')
df_t5 = pd.read_csv('tables_pages_3-14_16/table_05_page7.csv')
df_t6 = pd.read_csv('tables_pages_3-14_16/table_06_page8.csv')
df_t7 = pd.read_csv('tables_pages_3-14_16/table_07_page9.csv')
df_t8 = pd.read_csv('tables_pages_3-14_16/table_08_page10.csv')
df_t9 = pd.read_csv('tables_pages_3-14_16/table_09_page11.csv', on_bad_lines='skip')
df_t10 = pd.read_csv('tables_pages_3-14_16/table_10_page12.csv', on_bad_lines='skip')
df_t11 = pd.read_csv('tables_pages_3-14_16/table_11_page12.csv')
df_t12 = pd.read_csv('tables_pages_3-14_16/table_12_page13.csv')
df_t13 = pd.read_csv('tables_pages_3-14_16/table_13_page14.csv')
df_t14 = pd.read_csv('tables_pages_3-14_16/table_14_page14.csv')
df_t15 = pd.read_csv('tables_pages_3-14_16/table_15_page16.csv')
df_t16 = pd.read_csv('tables_pages_3-14_16/table_16_page16.csv')

In [11]:
df_t1.head()

            Year     Male   Female All students
0            K–2  103,234   96,452      199,686
1            3–6  143,276  131,493      274,769
2  Primary total  246,510  227,945      474,455
3           7–10  119,561  108,212      227,773
4          11–12   41,479   42,727       84,206

In [12]:
df_t2.head()

,All students,Semester 1 \n(Term 1 and 2),Semester 2 \n(Term 3 and 4),Full year
0,Number of suspensions,NaN,NaN,NaN
1,Actual harm,"8,991","7,540","16,531"
2,Unacceptable risk to health \nand safety / wel...,"20,245","22,879","43,124"
3,Unknown / Not available,80,79,159
4,Total suspensions,"29,316","30,498","59,814"

In [13]:
df_t3.head()

                                  Primary students      Semester 1 Semester 2
0                                   (Term 1 and 2)  (Term 3 and 4)  Full year
1         Number of suspensions (Primary students)             NaN        NaN
2  Number of students suspended (Primary students)             NaN        NaN
3               Suspension rate (Primary students)             NaN        NaN
4                                             0.5%            0.6%       1.0%

↑ Modificar, no se scrappeo bien

In [14]:
df_t4.head()

,Secondary students,Semester 1,Semester 2
0,(Term 1 and 2),(Term 3 and 4),Full year
1,Number of suspensions (Secondary students),NaN,NaN
2,"16,891","18,826","35,717"
3,Number of students suspended (Secondary students),NaN,NaN
4,"12,325","13,886","21,542"

↑ Modificar, no se scrappeo bien

In [15]:
df_t5.head()

  Suspension descriptor Number of suspensions
0  Aggressive behaviour                 8,391
1               Assault                   590
2              Bullying                    58
3        Cyber bullying                    27
4  Misuse of technology                    66

In [ ]:
df_t6.head()

,SA4 group,Total \nsuspensions,Total number of \nstudents \nsuspended,Students \nsuspended as % \nof SA4 group \nenrolment
0,Sydney-North,"1,085",775,0.9%
1,Sydney-Inner,"1,697","1,090",2.0%
2,Sydney-South,"3,146","2,049",2.8%
3,Sydney-South West,"4,968","3,095",3.4%
4,Sydney-West,"3,600","2,315",2.4%

In [17]:
df_t7.head()

  Suspension descriptor Number of suspensions
0  Aggressive behaviour                17,478
1               Assault                   253
2              Bullying                   330
3        Cyber bullying                   165
4  Misuse of technology                 1,153

In [18]:
df_t8.head()

,Year,Enrolments,Suspended\nmales,Suspended\nfemales,All students\nsuspended,% student\nenrolment
0,K–2,"199,686",937,163,"1,100",0.6%
1,3–6,"274,769","3,002",623,"3,625",1.3%
2,Primary total,"474,455","3,939",786,"4,725",1.0%
3,7–10,"227,773","12,949","6,477","19,426",8.5%
4,11–12,"84,206","1,478",642,"2,120",2.5%

In [19]:
df_t9.head()

,Aboriginal students,Semester 1,Semester 2
0,(Term 1 and 2),(Term 3 and 4),Full year
1,Number of suspensions (Aboriginal students),NaN,NaN
2,"6,065","6,247","12,312"
3,Number of students suspended (Aboriginal stude...,NaN,NaN
4,Suspension rate (Aboriginal students),NaN,NaN

↑ Modificar, no se scrappeo bien

In [20]:
df_t10.head()

,Year,Aboriginal \nstudent enrolments,# Aboriginal,% Aboriginal\nstudents suspended
0,students suspended,NaN,NaN,NaN
1,K–2,"19,111",368,1.9%
2,3–6,"25,655","1,026",4.0%
3,Primary total,"44,766","1,394",3.1%
4,7–10,"23,351","2,436",10.4%

In [21]:
df_t11.head()

,Year,Aboriginal \nstudent enrolments,# Aboriginal\nstudents suspended,% Aboriginal\nstudents suspended
0,K–2,"19,111",354,1.9%
1,3–6,"25,655","1,309",5.1%
2,Primary total,"44,766","1,663",3.7%
3,7–10,"23,351","4,769",20.4%
4,11–12,"5,401",414,7.7%

In [22]:
df_t12.head()

,Students identified as receiving \nadjustments due to disability,Semester 1,Semester 2,Full year
0,(Term 1 and 2),(Term 3 and 4),NaN,NaN
1,Number of suspensions (students identified as ...,NaN,NaN,NaN
2,Actual harm,"5,561","4,269","9,830"
3,Unacceptable risk to health and \nsafety / wel...,"11,538","11,837","23,375"
4,Unknown / Not available,60,43,103

In [23]:
df_t13.head()

,Year,Enrolments of \nstudents with disability,# students with \ndisability suspended,% students with \ndisability suspended
0,% students with,NaN,NaN,NaN
1,disability suspended,NaN,NaN,NaN
2,K–2,"37,695",829,2.2%
3,3–6,"52,092","1,991",3.8%
4,Primary total,"89,787","2,820",3.1%

In [24]:
df_t14.head()

,Year,Enrolments of students \nwith disability,# students with \ndisability suspended,% students with \ndisability suspended
0,K–2,"37,695",860,2.3%
1,3–6,"52,092","2,559",4.9%
2,Primary total,"89,787","3,419",3.8%
3,7–10,"44,811","8,594",19.2%
4,11–12,"13,876",662,4.8%

In [25]:
df_t15.head()

,SA4 group,Total \nsuspensions,Total number of \nstudents \nsuspended,Students \nsuspended as % \nof SA4 group \nenrolment
0,SA4 group,NaN,NaN,NaN
1,Sydney-North,342,287,0.3%
2,Sydney-Inner,504,384,0.7%
3,Sydney-South,713,559,0.8%
4,Sydney-South West,"1,764","1,401",1.5%

In [26]:
df_t16.head()

,SA4 group,Total \nsuspensions,Total number of \nstudents \nsuspended,Students \nsuspended as % \nof SA4 group \nenrolment
0,Sydney-North,"1,085",775,0.9%
1,Sydney-Inner,"1,697","1,090",2.0%
2,Sydney-South,"3,146","2,049",2.8%
3,Sydney-South West,"4,968","3,095",3.4%
4,Sydney-West,"3,600","2,315",2.4%

# Bullying Frequency
https://www.education.sa.gov.au/department/research-and-statistics/statistics-and-data/wellbeing-and-engagement-collection-survey/about-wellbeing-and-engagement-collection#:~:text=School%20results

In [ ]:
data = {
    ('Happiness', 'High'): [24179, 21270, 6605, 52054],
    ('Happiness', 'Medium'): [11628, 16390, 7091, 35109],
    ('Happiness', 'Low'): [2769, 4685, 4163, 11617],
    ('Happiness', 'Total'): [38576, 42345, 17859, 98780],
    ('Satisfaction with life', 'High'): [19551, 16497, 5396, 41444],
    ('Satisfaction with life', 'Medium'): [13903, 17549, 6384, 37836],
    ('Satisfaction with life', 'Low'): [5139, 8320, 6087, 19546],
    ('Satisfaction with life', 'Total'): [38593, 42366, 17867, 98826],
    ('Sadness', 'High'): [24231, 19396, 4978, 48605],
    ('Sadness', 'Medium'): [11091, 16558, 6684, 34333],
    ('Sadness', 'Low'): [3331, 6492, 6278, 16101],
    ('Sadness', 'Total'): [38653, 42446, 17940, 99039],
    ('Worries', 'High'): [20325, 14335, 3576, 38236],
    ('Worries', 'Medium'): [12304, 16946, 6093, 35343],
    ('Worries', 'Low'): [5972, 11098, 8215, 25285],
    ('Worries', 'Total'): [38601, 42379, 17884, 98864]
}

index = ['Rarely', 'Monthly', 'Weekly', 'Total']
df = pd.DataFrame(data, index=index)

print(df)